tests/integration/test_flamelet_particle_gas_phase_coupling/foam_template/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ( 0 0 UZ );

boundaryField
{
    WALL
    {
        type            slip;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    INLET
    {
        type            fixedValue;
        value           uniform ( 0 0 UZ );
    }
}


// ************************************************************************* //
