tests/integration/test_flamelet_particle_gas_phase_coupling/foam_template/0.org/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0.3";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
1.051652602
1.051652714
1.051652782
1.051652828
1.051652856
1.05165287
1.051652878
1.0516529
...
)
;

boundaryField
{
    WALL
    {
        type            calculated;
        value           nonuniform List<scalar> 
16000
(
1.051653045
1.051652927
1.051652886
1.051652864
1.051652852
1.051652832
1.051652799
1.051652748
...
)
;
    }
    OUTLET
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.1743497796
0.1743504474
0.1743506918
0.1743505008
0.1743503302
0.1743505539
0.1743511517
0.1743517125
...
)
;
    }
    INLET
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
1.051651925
1.051652038
1.0516521
1.051652143
1.051652161
1.05165216
1.051652138
1.051652095
...
)
;
    }
}


// ************************************************************************* //
