tests/integration/test_flamelet_particle_gas_phase_coupling/foam_template/constant/carbCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      coalCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
soi              0.05;

solution
{
    active          true;
    transient       yes;
    coupled         true;
    cellValueSourceCorrection on;
    maxCo           0.3;

    sourceTerms
    {
        schemes
        {
            rho             semiImplicit 1;
            U               semiImplicit 1;
            Yi              semiImplicit 1;
            h               semiImplicit 1;
            radiation       semiImplicit 1;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        thermo:mu       cell;
        T               cellPoint;
        cp              cell;
        kappa           cell;
        p               cell;
        G               cell;
        mu              cell;
    }

    integrationSchemes
    {
        U               Euler;
        T               analytical;
    }
}

constantProperties
{
    rho0            1000;
    T0              400;
    particleModelType 1;
    subTimeSteps    50;

    Cp0             960;
    epsilon0        0.7;
    f0              0.5;
    TDevol          300;
    LDevol          0;
    hRetentionCoeff 1;
    constantVolume  false;
}

subModels
{
    particleForces
    {
    }

    injectionModels
    {
       model1
                {
                    type            manualInjection;
                    massTotal       0.5e-8;
                    parcelBasisType fixed;
                    nParticle       1;
                    SOI             0;
                    positionsFile   "particlePositions";
                    U0              (0 0 0);
                    sizeDistribution
                    {
                        type        fixedValue;
                        fixedValueDistribution
                        {
                            value   0.00021215688358941118;
                        }
                    }
                }
    }
    	

    

    dispersionModel none;

    patchInteractionModel standardWallInteraction;

    heatTransferModel RanzMarshall;

    compositionModel singleMixtureFraction;

    phaseChangeModel none;

    devolatilisationModel constantRateDevolatilisation;

    devolatilisationModelSTFS   none;

    stochasticCollisionModel none;

    surfaceReactionModel none;

    surfaceFilmModel none;

    heatCapacityModelSTFS none;

    radiation       off;
    

    patchInteractionModel standardWallInteraction;

    standardWallInteractionCoeffs
    {
        type            rebound;
        e               1;
        mu              0;
    }

    RanzMarshallCoeffs
    {
        BirdCorrection  true;
    }

    singleMixtureFractionCoeffs
    {
        phases
        (
            gas
            {
	    	CH2O 0.2;
	    	CH3O 0.2;
	    	CH3  0.1;
		O2   0.25;
		CO   0.25;
            }
            liquid
            {
            }
            solid
            {
	    	C   1;
            }
        );
        YGasTot0        1;
        YLiquidTot0     0;
        YSolidTot0      0;
    }

    constantRateDevolatilisationCoeffs
    {
        volatileData
        (
            (CH2O           RATE_FUEL1)
	    (CH3O	    RATE_FUEL1)
	    (CH3	    RATE_FUEL1)
	    (O2		    RATE_FUEL3_O2)
	    (CO		    RATE_FUEL3_CO)
        );
        residualCoeff   0.001;
    }

}




// ************************************************************************* //
